Revit 2024 API
BuiltInFailures.FamilyFailures.CannotLoadMetricFamilyToImperialProject Property
 Can't load a metric Family into an imperial Project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotLoadMetricFamilyToImperialProject { get; }
Visual Basic
Public Shared ReadOnly Property CannotLoadMetricFamilyToImperialProject As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotLoadMetricFamilyToImperialProject {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace